export const NORMALIZE_GENITIVE_FULLNAME_PROMPT = {
	prompt: `
Перетвори український ПІБ з називного відмінка:
- Чоловічі імена → родовий відмінок (кого?)
- Жіночі імена → знахідний відмінок (кого?)
- Виводити тільки результат

Приклади:
Огородній Борис Андрійович → Огороднього Бориса Андрійовича
Петренко Марія Олексіївна → Петренко Марію Олексіївну

ПІБ для перетворення:
`,
	build(input: string) {
		return `${this.prompt}\n${input}`
	}
}

export const NORMALIZE_BIRTH_PLACE_PROMPT = {
	prompt: `
Перетвори місце народження у формат для фрази "уродженець / уродженка".

Правила:

Якщо населений пункт є містом обласного значення (обласний центр) — формат такий:
→ міста [назва міста без змін]

В усіх інших випадках — формат такий:
→ [назва області в родовому відмінку] області, [тип населеного пункту] [назва без змін]

Приклади:

ЧЕРКАСЬКА ОБЛАСТЬ М. ЧЕРКАСИ → міста Черкаси

КИЇВСЬКА ОБЛАСТЬ С. БОЯРКА → Київської області, села Боярка

ХАРКІВСЬКА ОБЛАСТЬ М. ХАРКІВ → міста Харків

ЧЕРНІГІВСЬКА ОБЛАСТЬ М. НІЖИН → Чернігівської області, міста Ніжин

ПОЛТАВСЬКА ОБЛАСТЬ М. КРЕМЕНЧУК → Полтавської області, міста Кременчук

Форматований результат повинен відповідати питанню «звідки?», наприклад:
"уродженець міста Харків" або "уродженка Київської області, села Боярка".
`,
	build(input: string) {
		return `${this.prompt}\n${input}`
	}
}

export const NORMALIZE_REGISTARION_ADDRESS_PROMPT = {
	prompt: `
Ти — помічник для нормалізації українських адрес.

Твоє завдання — привести адресу у формат:
"область, район, населений пункт, вулиця й номер будинку, квартира (якщо є)".

Правила:

Якщо населений пункт є містом обласного значення, тоді не вказуй область і район.

Індекс, країну, КОАТУУ — ігноруй.

Якщо є квартира, залиш її в кінці як кв. [номер].

Приклади:
Вхід: 02000, Україна, м. Київ, вул. Хрещатик, 22, кв. 15
Вихід: м. Київ, вул. Хрещатик, 22, кв. 15

Вхід: 12345, Україна, Житомирська обл., Бердичівський р-н, с. Райгородок, вул. Шевченка, 5, кв. 3
Вихід: Житомирська обл., Бердичівський р-н, с. Райгородок, вул. Шевченка, 5, кв. 3

Вхід: (коатуу-1820382401) 13432, Україна, Гальчин, Житомирська обл., Андрушівський р-н, с. Гальчин, вул. Заводська, 89, кв. 1
Вихід: Житомирська обл., Андрушівський р-н, с. Гальчин, вул. Заводська, 89, кв. 1

Відповідай лише нормалізованою адресою, без зайвих пояснень.

УКРАЇНА М. ЧЕРКАСИ ЧЕРКАСЬКИЙ РАЙОН ЧЕРКАСЬКА ОБЛАСТЬ ВУЛ. ДАХНІВСЬКА БУД. 42/1 КВ. 9
`,
	build(input: string) {
		return `${this.prompt}\n\n${input}\nВихід:`
	}
}

export const NORMALIZE_ISSUER_PROMPT = {
	prompt: `Нормалізуй орган для фрази "виданий [орган]":

ПРАВИЛА:
- Орудний відмінок (ким?)
- Перша літера слів з великої

ПРИКЛАД:
ЧЕРКАСЬКИЙ ВІДДІЛ → Черкаським відділом

Орган:`,
	build(input: string) {
		return `${this.prompt}\n${input}`
	}
}
